app/Helper/Helpers.php

select count(*) as aggregate from `produk` where `stok` <= `minimal_stok`
---
function stok()
{
  $produk = DB::table('produk')->whereColumn('stok', '<=', 'minimal_stok')->count();

select * from `produk` where `stok` <= `minimal_stok`
---
function messageStok()
{
  $products = DB::table('produk')->whereColumn('stok', '<=', 'minimal_stok')->get();