app/Http/Controllers/Admin/BarangMasukController.php

    public function index(Request $request)
    {
        $title = 'Barang Masuk';
        $products = Produk::latest()->get();
---
select * from `produk` order by `created_at` desc

    public function destroy($id)

    {
        $stockIn = BarangMasuk::findOrFail($id);
        $jumlah = $stockIn->jumlah;
        $produk_id = $stockIn->produk_id;
        $produk = Produk::findOrFail($produk_id);
        $produk->stok = $produk->stok - $jumlah;
        $produk->update();
        activity()->log('menghapus barang masuk ' . $produk->nama_produk);
        $delete = $stockIn->delete();
---
update `produk` set `stok` = 35, `produk`.`updated_at` = '2021-07-24 23:43:28' where `id` = '022c4807-fa65-4225-827d-3059a15f3689'
delete from `barang_masuk` where `id` = '00206668-3017-41fc-b8bd-431ab08d9ff1'