app/Http/Controllers/Admin/BarangKeluarController.php

select * from `produk` order by `created_at` desc
---
    public function index(Request $request)
    {
        $title = 'Barang Keluar';
        $products = Produk::latest()->get();