app/Http/Controllers/Admin/LaporanController.php

select * from `barang_masuk` where `tanggal` between '2021-07-01' and '2021-07-23'
---
    public function pdfBarangMasuk(Request $request)
    {
        $request->validate([
            'awal' => 'required',
            'akhir' => 'required',
        ]);
        $now = Carbon::now()->format('d F Y, H:i:s');
        $awal = $request->awal;
        $akhir = $request->akhir;
        $data = BarangMasuk::whereBetween('tanggal', [$awal, $akhir])->get();

select * from `kategori` where `kategori`.`id` in ('0266112b-942a-4f84-ab75-ac5fd9dc6b23')
select * from `produk` where `kategori_id` = '0266112b-942a-4f84-ab75-ac5fd9dc6b23'
select `kategori` from `kategori` where `id` = '0266112b-942a-4f84-ab75-ac5fd9dc6b23'
---
    public function pdfProduk(Request $request)
    {
        $now = Carbon::now()->format('d F Y, H:i A');
        $type = $request->type;
        $awal = $request->awal;
        $akhir = $request->akhir;
        $kategori = $request->kategori;
        if ($type == 'all') {
            $typeExport = "Semua Produk";
            $data = Produk::latest()->get();
            $totalProdukMasuk = $data->sum('jumlah');
            $totalItemProduk = $data->count();
        } elseif ($type == 'tanggal') {
            $typeExport = "Berdasarkan Tanggal Pembelian " . tanggal($awal) . " sampai " . tanggal($akhir);
            $awal = Carbon::parse($awal)->format('Y-m-d H:i:s');
            $akhir = Carbon::parse($akhir)->format('Y-m-d H:i:s');
            $data = Produk::whereBetween('created_at', [$awal, $akhir])->get();
            $totalProdukMasuk = $data->sum('jumlah');
            $totalItemProduk = $data->count();
        } elseif ($type == 'category') {
            $request->validate([
                'kategori' => 'required'
            ]);
            $data = Produk::where('kategori_id', '=', $kategori)->get();
            $category = Kategori::where('id', '=', $kategori)->pluck('kategori')->first();