app/Http/Controllers/Admin/ProdukController.php

select * from `kategori` order by `created_at` desc
select * from `gudang` order by `created_at` desc
---
    public function index(Request $request)
    {
        $title = 'Data Barang';
        $daftar_kategori = Kategori::latest()->get();
        $daftar_gudang = Gudang::latest()->get();

select * from `gudang` order by `created_at` desc
select * from `kategori` order by `created_at` desc
---
    public function create()
    {
        $title = 'Tambah Produk';
        $daftar_gudang = Gudang::latest()->get();
        $daftar_kategori = Kategori::latest()->get();

insert into `barang_masuk` (`produk_id`, `jumlah`, `tanggal`, `keterangan`, `penerima`, `id`, `updated_at`, `created_at`) values ('\"ed0bfab6-eee8-4338-9bdd-36dbcf8bfbf0\"', '5', '2021-07-24', '', 'Ardi Nur Dzariat', '\"10c949b5-6b59-4f18-bd5b-6620e4cdf4e5\"', '2021-07-24 20:44:39', '2021-07-24 20:44:39')
---
        $barang_masuk->tanggal = Carbon::parse($data->created_at)->format('Y-m-d');
        $barang_masuk->keterangan = $data->keterangan;
        $barang_masuk->penerima = auth()->user()->name;
        $save = $barang_masuk->save();