app/Http/Controllers/Admin/ProfileUserController.php

update `users` set `foto` = 'ardizariat_162713902560fc2bd191b63.jpg', `users`.`updated_at` = '2021-07-24 22:03:45' where `id` = 1
---
    public function update(Request $request)
    {
        $data = auth()->user();

        $id = $data->id;
        $request->validate([
            'username' => 'unique:users,username,' . $id,
            'email' => 'unique:users,email,' . $id,
        ]);

        if ($request->hasFile('foto')) {
            $file = $request->file('foto');

            $request->validate([
                'foto' => 'image|max:2048|mimes:png,jpg,jpeg,svg'
            ]);

            if ($data->foto) {
                Storage::delete('/user/' . $data->foto);
            }

            $extension = $file->getClientOriginalExtension();
            $filename = $request->username . '_' . time() . uniqid() . '.' . $extension;
            $path = $file->storeAs('/user/', $filename);
            $data->update([
                'foto' => $filename
            ]);

update `users` set `password` = 'y$I3cXKBGdyvLJ0NwTICi5kObI/hYv/bLYYKp1Aj/IwZioUnU1/SgTa', `users`.`updated_at` = '2021-07-24 23:44:05' where `id` = 1
---
    public function update_password(Request $request)
    {
        $data = auth()->user();
        $cek_password = Hash::check($request->old_password, $data->password);
        $request->validate([
            'old_password' => [
                'required', function ($attribute, $value, $fail) {
                    if (!Hash::check($value, Auth::user()->password)) {
                        $fail('Password lama salah!');
                    }
                },
            ],
            'password' => 'confirmed|min:4',
        ]);
        if ($cek_password) {
            if ($request->password == $request->password_confirmation) {
                $save = $data->update([
                    'password' => Hash::make($request->password),
                ]);