app/Http/Controllers/Admin/UserController.php

  public function index(Request $request)
  {
    $title = 'Pengguna';
    $status = $request->status;
    if (request()->ajax()) {
      if (!empty($status)) {
        $data = User::where('status', '=', $status)
          ->get();
---
select * from `users` where `status` = 'ditangguhkan'